{"keras_version": "2.1.6-tf", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "dtype": "float32", "name": "dense", "activity_regularizer": null, "units": 12, "batch_input_shape": [null, 8], "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32", "distribution": "uniform"}}, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "dtype": "float32", "name": "dense_1", "activity_regularizer": null, "units": 8, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32", "distribution": "uniform"}}, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "dtype": "float32", "name": "dense_2", "activity_regularizer": null, "units": 1, "kernel_constraint": null, "bias_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32", "distribution": "uniform"}}, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}], "backend": "tensorflow"}